# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
#
# Пример:
#
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21
A = [0,0]
B = [0,0]
A[0] = float (input("Введите коордаинату x точки А: "))
A[1] = float (input("Введите коордаинату y точки А: "))
B[0] = float (input("Введите коордаинату x точки B: "))
B[1] = float (input("Введите коордаинату y точки B: "))
distance = round( ( (B[0]-A[0])**2 + (B[1]-A[1])**2 )**0.5, 2 )
print("Расстояние между точками А и В: {}".format(distance))


